OpenROAD f9c91ab39bdd6c7c9d36e563fd398e544eaf48d7 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 28 thread(s).
read_liberty /home/nanocoh/dev/ORFS-K/OpenROAD-flow-scripts-KF/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib
read_liberty /home/nanocoh/dev/ORFS-K/OpenROAD-flow-scripts-KF/flow/platforms/nangate45/lib/fakeram45_256x32.lib
read_liberty /home/nanocoh/dev/ORFS-K/OpenROAD-flow-scripts-KF/flow/platforms/nangate45/lib/fakeram45_64x64.lib
read_db ./results/nangate45/mempool_group/base/2_3_floorplan_tapcell.odb
source /home/nanocoh/dev/ORFS-K/OpenROAD-flow-scripts-KF/flow/platforms/nangate45/setRC.tcl
[INFO PDN-0001] Inserting grid: grid
write_db ./results/nangate45/mempool_group/base/2_4_floorplan_pdn.odb
Elapsed time: 0:01.93[h:]min:sec. CPU time: user 1.77 sys 0.14 (99%). Peak memory: 409008KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_4_floorplan_pdn                  1            399 1454de48e658ee932864
