OpenROAD f9c91ab39bdd6c7c9d36e563fd398e544eaf48d7 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 28 thread(s).
read_liberty /home/nanocoh/dev/ORFS-K/OpenROAD-flow-scripts-KF/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib
read_liberty /home/nanocoh/dev/ORFS-K/OpenROAD-flow-scripts-KF/flow/platforms/nangate45/lib/fakeram45_256x32.lib
read_liberty /home/nanocoh/dev/ORFS-K/OpenROAD-flow-scripts-KF/flow/platforms/nangate45/lib/fakeram45_64x64.lib
read_db ./results/nangate45/mempool_group/base/3_1_place_gp_skip_io.odb
source /home/nanocoh/dev/ORFS-K/OpenROAD-flow-scripts-KF/flow/platforms/nangate45/setRC.tcl
place_pins -hor_layers metal5 -ver_layers metal6
Found 0 macro blocks.
Using 2 tracks default min distance between IO pins.
[INFO PPL-0001] Number of available slots 7842
[INFO PPL-0002] Number of I/O             1273
[INFO PPL-0003] Number of I/O w/sink      1251
[INFO PPL-0004] Number of I/O w/o sink    22
[INFO PPL-0005] Slots per section         200
[INFO PPL-0008] Successfully assigned pins to sections.
[INFO PPL-0012] I/O nets HPWL: 202416.05 um.
write_db ./results/nangate45/mempool_group/base/3_2_place_iop.odb
Elapsed time: 0:00.68[h:]min:sec. CPU time: user 0.54 sys 0.13 (99%). Peak memory: 344016KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_2_place_iop                      0            335 3f50429c8e2fd72a905f
