OpenROAD 701085d1e57df45a6aee387c04309628e0233ba8 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 28 thread(s).
read_liberty /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/ihp-sg13g2/lib/sg13g2_stdcell_typ_1p20V_25C.lib
[INFO ODB-0227] LEF file: /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/ihp-sg13g2/lef/sg13g2_tech.lef, created 19 layers, 70 vias
[INFO ODB-0227] LEF file: /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/ihp-sg13g2/lef/sg13g2_stdcell.lef, created 84 library cells
link_design -hier ibex_core
[WARNING ORD-0011] Hierarchical flow (-hier) is currently in development and may cause multiple issues. Do not use in production environments.
source /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/ihp-sg13g2/setRC.tcl
write_db ./results/ihp-sg13g2/ibex/base/1_synth.odb
write_sdc -no_timestamp ./results/ihp-sg13g2/ibex/base/1_synth.sdc
Elapsed time: 0:00.28[h:]min:sec. CPU time: user 0.23 sys 0.03 (94%). Peak memory: 127612KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
1_synth                            0            124 5667ee96de1e28a29294
