OpenROAD 701085d1e57df45a6aee387c04309628e0233ba8 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 28 thread(s).
read_liberty /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/ihp-sg13g2/lib/sg13g2_stdcell_typ_1p20V_25C.lib
read_db -hier ./results/ihp-sg13g2/ibex/base/2_1_floorplan.odb
[WARNING ORD-0012] Hierarchical flow (-hier) is currently in development and may cause multiple issues. Do not use in production environments.
source /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/ihp-sg13g2/setRC.tcl
No macros found: Skipping macro_placement
write_db ./results/ihp-sg13g2/ibex/base/2_2_floorplan_macro.odb
Elapsed time: 0:00.20[h:]min:sec. CPU time: user 0.16 sys 0.03 (99%). Peak memory: 123676KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_2_floorplan_macro                0            120 7581c33b5b462ac69daa
