OpenROAD 701085d1e57df45a6aee387c04309628e0233ba8 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 28 thread(s).
read_liberty /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/ihp-sg13g2/lib/sg13g2_stdcell_typ_1p20V_25C.lib
read_db -hier ./results/ihp-sg13g2/ibex/base/3_1_place_gp_skip_io.odb
[WARNING ORD-0012] Hierarchical flow (-hier) is currently in development and may cause multiple issues. Do not use in production environments.
source /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/ihp-sg13g2/setRC.tcl
place_pins -hor_layers Metal3 -ver_layers Metal2
Found 0 macro blocks.
Using 2 tracks default min distance between IO pins.
[INFO PPL-0001] Number of available slots 2770
[INFO PPL-0002] Number of I/O             264
[INFO PPL-0003] Number of I/O w/sink      256
[INFO PPL-0004] Number of I/O w/o sink    8
[INFO PPL-0005] Slots per section         200
[INFO PPL-0008] Successfully assigned pins to sections.
[INFO PPL-0012] I/O nets HPWL: 50663.88 um.
write_db ./results/ihp-sg13g2/ibex/base/3_2_place_iop.odb
Elapsed time: 0:00.19[h:]min:sec. CPU time: user 0.17 sys 0.01 (100%). Peak memory: 124832KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_2_place_iop                      0            121 aeb366f1ce900a2d5619
