OpenROAD 701085d1e57df45a6aee387c04309628e0233ba8 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 28 thread(s).
read_liberty /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib
read_liberty /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/nangate45/lib/fakeram45_512x64.lib
read_liberty /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/nangate45/lib/fakeram45_256x95.lib
read_liberty /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/nangate45/lib/fakeram45_64x7.lib
read_liberty /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/nangate45/lib/fakeram45_64x15.lib
read_liberty /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/nangate45/lib/fakeram45_64x96.lib
read_db ./results/nangate45/bp/base/3_1_place_gp_skip_io.odb
source /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/nangate45/setRC.tcl
place_pins -hor_layers metal5 -ver_layers metal6
Found 24 macro blocks.
Using 2 tracks default min distance between IO pins.
[INFO PPL-0001] Number of available slots 1964
[INFO PPL-0002] Number of I/O             1198
[INFO PPL-0003] Number of I/O w/sink      1198
[INFO PPL-0004] Number of I/O w/o sink    0
[INFO PPL-0005] Slots per section         200
[INFO PPL-0008] Successfully assigned pins to sections.
[INFO PPL-0012] I/O nets HPWL: 567960.94 um.
write_db ./results/nangate45/bp/base/3_2_place_iop.odb
Elapsed time: 0:01.38[h:]min:sec. CPU time: user 1.17 sys 0.20 (99%). Peak memory: 548236KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_2_place_iop                      1            535 dd72bfd1518f293720bb
