OpenROAD 6975124cf258e3be0db86bd2e59246b7f0e9f0c7 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 28 thread(s).
read_liberty -corner slow /home/nanocoh/dev/ORFS-K/OpenROAD-flow-scripts-KF/flow/platforms/ihp-sg13g2/lib/sg13g2_stdcell_slow_1p08V_125C.lib
read_liberty -corner typ /home/nanocoh/dev/ORFS-K/OpenROAD-flow-scripts-KF/flow/platforms/ihp-sg13g2/lib/sg13g2_stdcell_typ_1p20V_25C.lib
read_liberty -corner fast /home/nanocoh/dev/ORFS-K/OpenROAD-flow-scripts-KF/flow/platforms/ihp-sg13g2/lib/sg13g2_stdcell_fast_1p32V_m40C.lib
[INFO ODB-0227] LEF file: /home/nanocoh/dev/ORFS-K/OpenROAD-flow-scripts-KF/flow/platforms/ihp-sg13g2/lef/sg13g2_tech.lef, created 19 layers, 70 vias
[INFO ODB-0227] LEF file: /home/nanocoh/dev/ORFS-K/OpenROAD-flow-scripts-KF/flow/platforms/ihp-sg13g2/lef/sg13g2_stdcell.lef, created 84 library cells
link_design I2cDeviceCtrl
[WARNING STA-0347] current_design for other than top cell not supported.
source /home/nanocoh/dev/ORFS-K/OpenROAD-flow-scripts-KF/flow/platforms/ihp-sg13g2/setRC.tcl
write_db ./results/ihp-sg13g2/i2c-gpio-expander_I2cDeviceCtrl/base/1_synth.odb
write_sdc -no_timestamp ./results/ihp-sg13g2/i2c-gpio-expander_I2cDeviceCtrl/base/1_synth.sdc
Elapsed time: 0:00.20[h:]min:sec. CPU time: user 0.18 sys 0.02 (100%). Peak memory: 102216KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
1_synth                            0             99 630ec6e12fa21dee8000
