OpenROAD 701085d1e57df45a6aee387c04309628e0233ba8 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 28 thread(s).
read_liberty /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
[INFO ODB-0227] LEF file: /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/sky130hd/lef/sky130_fd_sc_hd.tlef, created 13 layers, 25 vias
[INFO ODB-0227] LEF file: /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/sky130hd/lef/sky130_fd_sc_hd_merged.lef, created 441 library cells
link_design gcd
source /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/sky130hd/setRC.tcl
write_db ./results/sky130hd/gcd/base/1_synth.odb
write_sdc -no_timestamp ./results/sky130hd/gcd/base/1_synth.sdc
Elapsed time: 0:00.28[h:]min:sec. CPU time: user 0.26 sys 0.01 (99%). Peak memory: 115608KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
1_synth                            0            112 f77955f65c274ee067a2
