OpenROAD 701085d1e57df45a6aee387c04309628e0233ba8 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 28 thread(s).
read_liberty /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/gcd/base/2_1_floorplan.odb
source /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/sky130hd/setRC.tcl
No macros found: Skipping macro_placement
write_db ./results/sky130hd/gcd/base/2_2_floorplan_macro.odb
Elapsed time: 0:00.24[h:]min:sec. CPU time: user 0.23 sys 0.01 (98%). Peak memory: 113936KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_2_floorplan_macro                0            111 1c532bdf5515bd69e4f7
