OpenROAD 701085d1e57df45a6aee387c04309628e0233ba8 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 28 thread(s).
read_liberty /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/gcd/base/2_2_floorplan_macro.odb
source /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/sky130hd/setRC.tcl
[INFO TAP-0005] Inserted 72 tapcells.
write_db ./results/sky130hd/gcd/base/2_3_floorplan_tapcell.odb
Elapsed time: 0:00.25[h:]min:sec. CPU time: user 0.22 sys 0.02 (99%). Peak memory: 113600KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_3_floorplan_tapcell              0            110 cdd266af3bae7faa22bd
