OpenROAD 701085d1e57df45a6aee387c04309628e0233ba8 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 28 thread(s).
read_liberty /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/gcd/base/2_3_floorplan_tapcell.odb
source /home/nanocoh/dev/ORFS-K/try/OpenROAD-flow-scripts-KF/flow/platforms/sky130hd/setRC.tcl
[INFO PDN-0001] Inserting grid: grid
write_db ./results/sky130hd/gcd/base/2_4_floorplan_pdn.odb
Elapsed time: 0:00.26[h:]min:sec. CPU time: user 0.23 sys 0.03 (100%). Peak memory: 116484KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_4_floorplan_pdn                  0            113 fd856ca2d262ac47d2f1
